Revit 2024 API
WallFoundation.WallId Property
 Returns the id of the host wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public ElementId WallId { get; }
Visual Basic
Public ReadOnly Property WallId As ElementId
	Get
Visual C++
public:
property ElementId^ WallId {
	ElementId^ get ();
}
See Also
WallFoundation Class
Autodesk.Revit.DB Namespace